{
    "Deployment Analytics":{"type":1, "title":"Deployment Analytics", "image":"/deploy-analytics.png", "w":2038, "h":913, "alt":"An image of the analytics dashboard for the Replit blog", "link":"https://blog.replit.com/deployments-analytics", "description":"Built analytics at Replit for thousands of websites hosted on Replit using Google Bigtable, NATS, and a custom deployments proxy. Additionally prototyped AI-powered debugging of deployment failures and analytics summary emails."},
    "ANIMA":{"type":20, "title":"ANIMA", "link":"https://github.com/thewindsofwinter/anima", "image":"/2mo-neural.png", "w":1012, "h":1012, "alt":"An image of a brain slice with neurons and glial cells visible in stain",
        "description":"Sped up postmortem brain damage analysis in epileptic mice by 98% compared to manual methods with novel graph-based algorithm. Published in PNAS 119(51), DOI: 10.1073/pnas.2021265118."},
    "Magic Transit GRE Optimization":{"type":1, "title":"GRE Optimization", "image":"/cloudflare.png", "w":2496, "h":1096,"alt":"A stylized banner depicting Cloudflare's Magic Transit.","link":"https://www.cloudflare.com/network-services/products/magic-transit/","description":"At Cloudflare, sped up GRE tunnel creation/modification by two orders of magnitude, direct impact on corporations like Wikipedia and Zoom."},
    "TreeHack":{"type":13, "title":"TreeHack", "link":"https://github.com/thewindsofwinter/treehack", "image":"/treehack.png", "w":1276, "h":757, "alt":"An image depicting the before-and-after transformation of a street using TreeHack.", "description":"For HackMIT, we integrated OpenAI CLiP with Stable Diffusion to generate realistic views of well-shaded streets to reduce \"hotspots\" of elevated heat in urban areas."},
    "Interview Insights":{"type":13, "title":"Interview Insight", "link":"https://github.com/thewindsofwinter/learn-adapt", "image":"/interview-insight.png", "w":1144, "h":778, "alt":"An image showing a user engaging with our teachable agent.", "description":"Interview Insight uses GPT-4, Whisper, and Hume AI to allow live evaluation of a teacher, student, or interviewee as they practice their interview."},
    "JHMC":{"type":31, "title":"JHMC Website", "link":"https://github.com/thewindsofwinter/JHMC-scripts", "image":"/virtual-jhmc.png", "w":2048, "h":1316, "alt":"An image of the Junior High Math Contest 2022 homepage",
        "description":"Built an online contest platform with Patrick Hultquist to handle 1,000+ tests, which I refined for a nationwide hybrid contest in 2022."},
    "Robotics":{"type":32, "title":"Robotics Website", "link":"https://roboticsclub.stanford.edu", "image":"/robosite.png", "w":1647, "h":1177, "alt":"A partial picture of the projects page on our robotics website.",
        "description":"A platform for the student robotics community at Stanford to build robots, which I built as president of Stanford Student Robotics."},
    "Excaliblaze":{"type":42, "title":"Excaliblaze", "link":"https://excaliblaze.vercel.app", "image":"/excaliblaze.png", "w":2335, "h":877, "alt":"A website allowing you to laser-cut or engrave everything at Stanford.",
        "description":"A website which directly connects to the lab64 laser cutter at Stanford (currently disabled), allowing you to laser-cut anything with the power of generative AI."},
    "Solar Flare Prediction":{"type":33, "title":"Solar Flares", "link":"https://drive.google.com/drive/folders/14i9dloRbgYRf9NKIxSMi8x11xfzvkahh?usp=sharing", "image":"/solar.png", "w":541, "h":264, "alt":"An image of vision transformer regressing on solar flare",
    "description":"Collated high-quality dataset of solar images and X-ray flux for one year and built state-of-the-art vision transformer to predict solar flares."},
    "Multi24":{"type":42, "title":"24 Together", "link":"https://github.com/thewindsofwinter/24-together", "image":"/24-together.png", "w":2559, "h":1530, "alt":"An image of the 24 game interface, with chat to the left of the game and game history to the right of the game",
        "description":"The first multiplayer implementation of the Chinese number game \"24\", used to keep in touch with friends virtually."},
        "USNCO":{"type":30, "title":"Lavoisier", "link":"https://github.com/thewindsofwinter/usnco-problems", "image":"/lavoisier.png", "w":750, "h":576, "alt":"An example of a Discord query for a Chemistry Olympiad problem",
            "description":"Created first public dataset of 2,466 high-quality chemistry olympiad problems as images, which have been served thousands of times through a Discord bot."},
    "Fortune-ate":{"type":43, "title":"Fortune-ate", "link":"https://replit.com/@andyatreplit/gpt-fortunes", "image":"/fortune-generator.png", "w":1809, "h":894, "alt":"A simple UI for selecting the best fortune cookies",
        "description":"A website to generate fortune cookies using GPT, which fine-tunes to your preference in fortunes to generate the most useful (or flattering) fortune cookies."}
}