{
    "ANIMA":{"type":0, "title":"ANIMA", "link":"https://github.com/thewindsofwinter/anima", "image":"../2mo-neural.png", 
        "description":"I developed a novel graph-based algorithm to quantify the extent of astrogliosis (brain scarring) in images of immunostained mouse brain slices, improving accuracy and cutting image analysis times by 98% compared to existing manual methods. The results of our analysis were published in PNAS 119(51), DOI: 10.1073/pnas.2021265118."},
    "USNCO":{"type":0, "title":"Lavoisier", "link":"https://github.com/thewindsofwinter/usnco-problems", "image":"../lavoisier.png", 
        "description":"The US National Chemistry Olympiad has excellent practice material, but it's hard to sift through 20+ years of content. I converted 2,688 problems to images via Apache PDFBox and categorized them by topic and difficulty. These problems have been queried 5,000+ times to date by Lavoisier, a Discord bot I built on this problem bank for chemistry students."},
    "JHMC":{"type":1, "title":"JHMC Website", "link":"https://github.com/thewindsofwinter/JHMC-scripts", "image":"../virtual-jhmc.png", 
        "description":"For 30+ years, my high school has hosted the Junior High Math Contest (JHMC) for talented math students in Illinois. Unfortunately, the COVID-19 pandemic made an in-person contest impossible for 2021. Undeterred, Patrick Hultquist and I built an online contest platform to handle 1,000+ tests, which I refined for a nationwide hybrid contest in 2022."},
    "Multi24":{"type":2, "title":"24 Together", "link":"https://github.com/thewindsofwinter/24-together", "image":"../24-together.png", 
        "description":"When I was young, I made many magical memories hanging out with friends playing 24, a Chinese card game where you race to make 24 out of four cards. Over the summer, I built the first multiplayer implementation of 24 on the web using Pusher and Next, and it's quickly become a wholesome centerpiece of my long-distance friendships."},
    "Azimuth":{"type":3,"title":"Azimuth", "link":"https://github.com/thewindsofwinter/azimuth", "image":"../construction.jpg", 
        "description":"There are many good online quizzes for personality, politics, and even Disney princesses, but few for career satisfaction. Azimuth seeks to solve this by asking users to compare concrete situations to find out what line of work might be most fulfilling for them, outputting a non-judgemental career compass (akin to the political compass)."},
    "Fortune-ate":{"type":3, "title":"Fortune-ate", "link":"https://github.com/thewindsofwinter/fortune-ate-cookies", "image":"../construction.jpg", 
        "description":"As a Chinese-American, I've ordered Chinese takeout numerous times and thus eaten many fortune cookies. The vague advice was... hit or miss, to be honest, but I soon wondered if I could make a better advice-giving machine. Fortune-ate cookies will give you a fortune cookie a day which you rate for helpfulness, training an AI to converge on the advice you need."}
}